Terraform Plan:
```aws_ecs_cluster.fargate_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:cluster/fargate-cluster]
aws_ecs_task_definition.grafana: Refreshing state... [id=grafana]
aws_ecs_task_definition.prometheus: Refreshing state... [id=prometheus]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-0769fc3f0a1e0369d]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_ecs_service.prometheus_service: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/prometheus-service]
aws_security_group.fargate_sg: Refreshing state... [id=sg-0788f6d6e7e5e4270]
aws_ecs_service.grafana_service: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/grafana-service]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_execution_role]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_execution_role:ecs_execution_role_policy]
aws_internet_gateway.gw: Refreshing state... [id=igw-023eff6b19fbc8386]
aws_subnet.public1: Refreshing state... [id=subnet-0e8a8b2387a038517]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_subnet.private2: Refreshing state... [id=subnet-03869eba2620a72a4]
aws_subnet.private1: Refreshing state... [id=subnet-0dd981dc576918c96]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/80498dd36909bb7a]
aws_route_table.public: Refreshing state... [id=rtb-054b7988ab4f56ef5]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0577b7cf0865f9b59]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-0a6f1e2a1d786d5c9]
aws_nat_gateway.nat: Refreshing state... [id=nat-0e9b83e07e82ff8ea]
aws_lb.grafana_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/20f01ea24b47aea8]
aws_route_table.private: Refreshing state... [id=rtb-00c56dde623266ee6]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-0530eb8faa8321338]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-0e8b878ffd48b9d71]
aws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/20f01ea24b47aea8/7691719dfc462932]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_ecs_cluster.fargate_cluster will be destroyed
  # (because aws_ecs_cluster.fargate_cluster is not in configuration)
  - resource "aws_ecs_cluster" "fargate_cluster" {
      - arn      = "arn:aws:ecs:us-east-1:941133421128:cluster/fargate-cluster" -> null
      - id       = "arn:aws:ecs:us-east-1:941133421128:cluster/fargate-cluster" -> null
      - name     = "fargate-cluster" -> null
      - tags     = {} -> null
      - tags_all = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_service.grafana_service will be destroyed
  # (because aws_ecs_service.grafana_service is not in configuration)
  - resource "aws_ecs_service" "grafana_service" {
      - cluster                            = "arn:aws:ecs:us-east-1:941133421128:cluster/fargate-cluster" -> null
      - deployment_maximum_percent         = 100 -> null
      - deployment_minimum_healthy_percent = 0 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/grafana-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "grafana-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana:9" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "grafana" -> null
          - container_port   = 3000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/80498dd36909bb7a" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-0788f6d6e7e5e4270",
            ] -> null
          - subnets          = [
              - "subnet-03869eba2620a72a4",
              - "subnet-0dd981dc576918c96",
            ] -> null
        }
    }

  # aws_ecs_service.prometheus_service will be destroyed
  # (because aws_ecs_service.prometheus_service is not in configuration)
  - resource "aws_ecs_service" "prometheus_service" {
      - cluster                            = "arn:aws:ecs:us-east-1:941133421128:cluster/fargate-cluster" -> null
      - deployment_maximum_percent         = 100 -> null
      - deployment_minimum_healthy_percent = 0 -> null
      - desired_count                      = 0 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/prometheus-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "prometheus-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus:6" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-0788f6d6e7e5e4270",
            ] -> null
          - subnets          = [
              - "subnet-03869eba2620a72a4",
              - "subnet-0dd981dc576918c96",
            ] -> null
        }
    }

  # aws_ecs_task_definition.grafana will be destroyed
  # (because aws_ecs_task_definition.grafana is not in configuration)
  - resource "aws_ecs_task_definition" "grafana" {
      - arn                      = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana:9" -> null
      - arn_without_revision     = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 256
                  - environment      = []
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:3000/ || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 15
                      - timeout     = 5
                    }
                  - image            = "grafana/grafana-enterprise:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/siem"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "grafana"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "grafana"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::941133421128:role/ecs_execution_role" -> null
      - family                   = "grafana" -> null
      - id                       = "grafana" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 9 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

  # aws_ecs_task_definition.prometheus will be destroyed
  # (because aws_ecs_task_definition.prometheus is not in configuration)
  - resource "aws_ecs_task_definition" "prometheus" {
      - arn                      = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus:6" -> null
      - arn_without_revision     = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 256
                  - environment      = []
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:9090/ || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 15
                      - timeout     = 5
                    }
                  - image            = "prom/prometheus:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/siem"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "prometheus"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "prometheus"
                  - portMappings     = [
                      - {
                          - containerPort = 9090
                          - hostPort      = 9090
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::941133421128:role/ecs_execution_role" -> null
      - family                   = "prometheus" -> null
      - id                       = "prometheus" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 6 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

  # aws_lb.grafana_alb will be updated in-place
  ~ resource "aws_lb" "grafana_alb" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/20f01ea24b47aea8"
        name                                        = "grafana-alb"
      ~ security_groups                             = [
          - "sg-0788f6d6e7e5e4270",
        ] -> (known after apply)
        tags                                        = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.all will be created
  + resource "aws_security_group" "all" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "open-all"
        }
      + tags_all               = {
          + "Name" = "open-all"
        }
      + vpc_id                 = "vpc-03e05ec4d7ef91467"
    }

  # aws_security_group.fargate_sg will be destroyed
  # (because aws_security_group.fargate_sg is not in configuration)
  - resource "aws_security_group" "fargate_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:941133421128:security-group/sg-0788f6d6e7e5e4270" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0788f6d6e7e5e4270" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "terraform-20240123122754861900000001" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "941133421128" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-03e05ec4d7ef91467" -> null
    }

Plan: 1 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```